package com.company.classes;

// 5.	Дано предложение.
// Заменить группы пробелов одиночными,
// крайние пробелы удалить.
// Все слова перевести в нижний регистр,
// первые буквы сделать заглавными.

public class Task05 {

    private String text = "lorem";

    public void Start() {
        System.out.println(text);
    }
}
